Repository: ricvecchio/rdv-performance-ios
Catalog: rdvperfomance/Localizable.xcstrings
Source language: pt_br
Languages: en, es

# personal_records_endurance.delete_item
source: Excluir item
en: Delete item
es: Eliminar elemento

# personal_records_endurance.e_g_3_45_120_or_10_32
source: Ex: 3:45 ou 120 ou 10:32
en: E.g.: 3:45, 120, or 10:32
es: Ej.: 3:45, 120 o 10:32

# personal_records_endurance.enter_your_best_result_leave_it_blank_to_remove_it
source: Informe seu melhor resultado. Para remover, deixe vazio.
en: Enter your best result. Leave it blank to remove it.
es: Ingresa tu mejor resultado. Déjalo vacío para eliminarlo.

# personal_records_endurance.new_endurance_item
source: Novo item de Endurance
en: New Endurance item
es: Nuevo elemento de Endurance

# personal_records_girls.add_new_wod
source: Adicionar novo WOD
en: Add new WOD
es: Agregar nuevo WOD

# personal_records_girls.add_your_best_result_for_each_workout
source: Adicione seu melhor resultado por treino.
en: Add your best result for each workout.
es: Agrega tu mejor resultado por entrenamiento.

# personal_records_girls.delete_wod
source: Excluir WOD
en: Delete WOD
es: Eliminar WOD

# personal_records_girls.e_g_12_34
source: Ex: 12.34
en: E.g.: 12.34
es: Ej.: 12.34

# personal_records_girls.enter_your_time_score_leave_it_blank_to_remove_it
source: Informe seu tempo/score. Para remover, deixe vazio.
en: Enter your time/score. Leave it blank to remove it.
es: Ingresa tu tiempo/puntaje. Déjalo vacío para eliminarlo.

# personal_records_girls.new_girls_wod
source: Novo WOD Girls
en: New Girls WOD
es: Nuevo WOD Girls

# personal_records_girls.workout
source: Treino
en: Workout
es: Entrenamiento

# personal_records_gymnastic.add_your_personal_record_for_each_movement
source: Adicione seu recorde por movimento.
en: Add your personal record for each movement.
es: Agrega tu récord por movimiento.

# personal_records_gymnastic.create_an_item_and_if_you_want_enter_your_record_now
source: Crie um item e, se quiser, já informe seu recorde.
en: Create an item and, if you want, enter your record now.
es: Crea un elemento y, si quieres, ingresa tu récord ahora.

# personal_records_gymnastic.e_g_50_1_90m_3_25
source: Ex: 50 / 1,90m / 3:25
en: E.g.: 50 / 1.90m / 3:25
es: Ej.: 50 / 1,90 m / 3:25

# personal_records_gymnastic.e_g_max_reps_for_time_max_distance
source: Ex: Max Reps / For Time / Max Distance
en: E.g.: Max Reps / For Time / Max Distance
es: Ej.: Máx. repeticiones / Por tiempo / Máxima distancia

# personal_records_gymnastic.e_g_rope_climb
source: Ex: Rope Climb
en: E.g.: Rope Climb
es: Ej.: Rope Climb

# personal_records_gymnastic.enter_your_record_leave_it_blank_to_remove_it
source: Informe seu recorde. Para remover, deixe vazio.
en: Enter your record. Leave it blank to remove it.
es: Ingresa tu récord. Déjalo vacío para eliminarlo.

# personal_records_gymnastic.new_item
source: Novo item
en: New item
es: Nuevo elemento

# personal_records_gymnastic.record_optional
source: Recorde (opcional)
en: Record (optional)
es: Récord (opcional)

# personal_records_gymnastic.type_metric_optional
source: Tipo / Métrica (opcional)
en: Type / Metric (optional)

# personal_records_heroes.add_your_best_time_for_each_wod
source: Adicione seu melhor tempo por WOD.
en: Add your best time for each WOD.
es: Agrega tu mejor tiempo por WOD.

# personal_records_heroes.new_hero_wod
source: Novo Hero WOD
en: New Hero WOD
es: Nuevo Hero WOD

# personal_records_notables.add_new_benchmark
source: Adicionar novo benchmark
en: Add new benchmark
es: Agregar nuevo benchmark

# personal_records_notables.delete_benchmark
source: Excluir benchmark
en: Delete benchmark
es: Eliminar benchmark

# personal_records_notables.e_g_7_32_210_reps_or_450_pts
source: Ex: 7:32 ou 210 reps ou 450 pts
en: E.g.: 7:32, 210 reps, or 450 pts
es: Ej.: 7:32, 210 reps o 450 pts

# personal_records_notables.new_benchmark
source: Novo benchmark
en: New benchmark
es: Nuevo benchmark

# personal_records_open.new_open_item
source: Novo item Open
en: New Open item
es: Nuevo elemento Open

# personal_records.barbell.delete_named_record_confirmation
source: Deseja excluir o registro de "%@"?
en: Do you want to delete the "%@" record?
es: ¿Quieres eliminar el registro de "%@"?

# personal_records.barbell.duplicate_movement
source: Este movimento já existe na sua lista.
en: This movement already exists in your list.
es: Este movimiento ya existe en tu lista.

# personal_records.barbell.max_load_optional_with_unit
source: Carga máxima (%@) (opcional)
en: Maximum load (%@) (optional)

# personal_records.barbell.max_load_with_unit
source: Carga máxima (%@):
en: Maximum load (%@):

# personal_records.barbell.movement_name_required
source: Informe o nome do movimento.
en: Enter the movement name.
es: Ingresa el nombre del movimiento.

# personal_records.barbell.new_movement_description
source: Crie um movimento e, se quiser, já informe a carga máxima em %@.
en: Create a movement and, if you want, enter its maximum load in %@ now.
es: Crea un movimiento y, si quieres, ingresa ahora su carga máxima en %@.

# personal_records.benchmark_fallback
source: este benchmark
en: this benchmark

# personal_records.campeonatos.duplicate_event
source: Esta prova já existe na sua lista.
en: This event already exists in your list.
es: Esta prueba ya existe en tu lista.

# personal_records.campeonatos.event_name_field
source: Nome da prova
en: Event name
es: Nombre de la prueba

# personal_records.campeonatos.event_name_required
source: Informe o nome da prova.
en: Enter the event name.
es: Ingresa el nombre de la prueba.

# personal_records.crossfit_games.custom_events_title
source: CrossFit Games %@ – Provas personalizadas
en: CrossFit Games %@ – Custom events
es: CrossFit Games %@ – Pruebas personalizadas

# personal_records.crossfit_games.duplicate_event
source: Esta prova já existe na sua lista.
en: This event already exists in your list.
es: Esta prueba ya existe en tu lista.

# personal_records.crossfit_games.event_name_field
source: Nome da prova
en: Event name
es: Nombre de la prueba

# personal_records.crossfit_games.year_and_event_required
source: Informe o ano e o nome da prova.
en: Enter the year and event name.
es: Ingresa el año y el nombre de la prueba.

# personal_records.crossfit_games.year_field
source: Ano
en: Year
es: Año

# personal_records.delete_record_confirmation
source: Deseja excluir o registro de %1$@?
en: Do you want to delete the %1$@ record?
es: ¿Quieres eliminar el registro de %1$@?

# personal_records.endurance.duplicate_item
source: Este item já existe na sua lista.
en: This item already exists in your list.
es: Este elemento ya existe en tu lista.

# personal_records.endurance.item_name_field
source: Nome do item
en: Item name
es: Nombre del elemento

# personal_records.endurance.item_name_required
source: Informe o nome do item.
en: Enter the item name.
es: Ingresa el nombre del elemento.

# personal_records.event_fallback
source: esta prova
en: this event
es: esta prueba

# personal_records.event_fallback_feminine
source: esta prova
en: this event
es: esta prueba

# personal_records.form.description_optional
source: Descrição (opcional)
en: Description (optional)
es: Descripción (opcional)

# personal_records.form.initial_result_optional
source: Resultado inicial (opcional)
en: Initial result (optional)

# personal_records.girls.duplicate_wod
source: Este WOD já existe na sua lista.
en: This WOD already exists in your list.
es: Este WOD ya existe en tu lista.

# personal_records.girls.wod_name_field
source: Nome do WOD
en: WOD name
es: Nombre del WOD

# personal_records.girls.wod_name_required
source: Informe o nome do WOD.
en: Enter the WOD name.
es: Ingresa el nombre del WOD.

# personal_records.gymnastic.delete_named_record_confirmation
source: Deseja excluir o registro de "%@"?
en: Do you want to delete the "%@" record?
es: ¿Quieres eliminar el registro de "%@"?

# personal_records.gymnastic.duplicate_item
source: Este item já existe na sua lista.
en: This item already exists in your list.
es: Este elemento ya existe en tu lista.

# personal_records.gymnastic.movement_name_required
source: Informe o nome do movimento.
en: Enter the movement name.
es: Ingresa el nombre del movimiento.

# personal_records.heroes.duplicate_wod
source: Este WOD já existe na sua lista.
en: This WOD already exists in your list.
es: Este WOD ya existe en tu lista.

# personal_records.heroes.wod_name_field
source: Nome do WOD
en: WOD name
es: Nombre del WOD

# personal_records.heroes.wod_name_required
source: Informe o nome do WOD.
en: Enter the WOD name.
es: Ingresa el nombre del WOD.

# personal_records.history
source: Histórico
en: History
es: Historial

# personal_records.import_from_tecnofit
source: Importar do Tecnofit
en: Import from Tecnofit
es: Importar desde Tecnofit

# personal_records.item_fallback
source: este item
en: this item
es: este elemento

# personal_records.movement
source: Movimento
en: Movement
es: Movimiento

# personal_records.notables.benchmark_name_required
source: Informe o nome do benchmark.
en: Enter the benchmark name.
es: Ingresa el nombre del benchmark.

# personal_records.notables.duplicate_benchmark
source: Este benchmark já existe na sua lista.
en: This benchmark already exists in your list.
es: Este benchmark ya existe en tu lista.

# personal_records.notables.format_optional
source: Formato (opcional)
en: Format (optional)

# personal_records.notables.name_field
source: Nome do benchmark
en: Benchmark name
es: Nombre del benchmark

# personal_records.open.duplicate_item
source: Este item já existe na sua lista.
en: This item already exists in your list.
es: Este elemento ya existe en tu lista.

# personal_records.open.item_name_field
source: Nome do item
en: Item name
es: Nombre del elemento

# personal_records.open.item_name_required
source: Informe o nome do item.
en: Enter the item name.
es: Ingresa el nombre del elemento.

# personal_records.open.wod_title_optional
source: Título do WOD (opcional)
en: WOD title (optional)
es: Título del WOD (opcional)

# personal_records.personal_record
source: Recorde Pessoal
en: Personal Record
es: Récord personal

# personal_records.placeholder.amrap
source: Ex: AMRAP 12 min
en: E.g.: AMRAP 12 min
es: Ej.: AMRAP 12 min

# personal_records.placeholder.benchmark_name
source: Ex: Meu benchmark
en: E.g.: My benchmark
es: Ej.: Mi benchmark

# personal_records.placeholder.burpees
source: Ex: 12 burpees
en: E.g.: 12 burpees
es: Ej.: 12 burpees

# personal_records.placeholder.event_name
source: Ex: Prova 1
en: E.g.: Event 1
es: Ej.: Prueba 1

# personal_records.placeholder.final
source: Ex: Final
en: E.g.: Final
es: Ej.: Final

# personal_records.placeholder.for_time
source: Ex: For Time
en: E.g.: For Time
es: Ej.: For Time

# personal_records.placeholder.for_time_21_15_9
source: Ex.: For Time — 21-15-9
en: E.g.: For Time — 21-15-9
es: Ej.: Por tiempo — 21-15-9

# personal_records.placeholder.for_time_five_rounds
source: Ex: For Time — 5 rounds
en: E.g.: For Time — 5 rounds
es: Ej.: For Time — 5 rounds

# personal_records.placeholder.for_time_girls
source: Ex: For Time — 21:15- 9
en: E.g.: For Time — 21:15- 9
es: Ej.: For Time — 21:15- 9

# personal_records.placeholder.for_time_three_rounds
source: Ex: For Time — 3 rounds
en: E.g.: For Time — 3 rounds
es: Ej.: For Time — 3 rounds

# personal_records.placeholder.hero_wod_name
source: Ex: Meu Hero WOD
en: E.g.: My Hero WOD
es: Ej.: Mi Hero WOD

# personal_records.placeholder.open_item
source: Ex: Open 26.1
en: E.g.: Open 26.1
es: Ej.: Open 26.1

# personal_records.placeholder.rounds
source: Ex: 3 rounds
en: E.g.: 3 rounds
es: Ej.: 3 rounds

# personal_records.placeholder.run
source: Ex: Corrida 3 km
en: E.g.: 3 km run
es: Ej.: Carrera de 3 km

# personal_records.placeholder.time
source: Ex: 12:34
en: E.g.: 12:34
es: Ej.: 12:34

# personal_records.placeholder.time_or_count
source: Ex: 12:34 ou 500
en: E.g.: 12:34 or 500
es: Ej.: 12:34 o 500

# personal_records.placeholder.time_or_points
source: Ex: 12:34 ou 150 pts
en: E.g.: 12:34 or 150 pts
es: Ej.: 12:34 o 150 pts

# personal_records.placeholder.time_or_reps
source: Ex: 12:34 ou 150 reps
en: E.g.: 12:34 or 150 reps
es: Ej.: 12:34 o 150 reps

# personal_records.placeholder.time_or_score
source: Ex: 12:34 ou 150
en: E.g.: 12:34 or 150
es: Ej.: 12:34 o 150

# personal_records.placeholder.year
source: Ex: 2026
en: E.g.: 2026
es: Ej.: 2026

# personal_records.progress
source: Evolução
en: Progress
es: Evolución

# personal_records.result_field_label
source: Resultado:
en: Result:

# personal_records.select_a_section
source: Selecione uma seção.
en: Select a section.
es: Selecciona una sección.

# personal_records.time_score_field_label
source: Tempo / Score:
en: Time / Score:
es: Tiempo / Puntaje:

# personal_records.time_score_label
source: Tempo / Score
en: Time / Score
es: Tiempo / Puntaje

# personal_records.wod_fallback
source: este WOD
en: this WOD

source: Personalizar Acesso rápido
en: Customize Quick Access
es: Personalizar acceso rápido

source: Peso
en: Weight

source: Planilha inválida. Verifique se é um arquivo .xlsx.
en: Invalid spreadsheet. Check that it is an .xlsx file.
es: Hoja de cálculo no válida. Verifica que sea un archivo .xlsx.

source: PR (tempo)
en: PR (time)
es: PR (tiempo)

source: Preview do Progresso
en: Progress Preview
es: Vista previa del progreso

source: Primeiro treino
en: First workout
es: Primer entrenamiento

source: Professor
en: Coach
es: Entrenador

source: professor@email.com
en: coach@email.com
es: entrenador@correo.com

source: Professores
en: Coaches
es: Entrenadores

source: PROFESSORES VINCULADOS
en: LINKED COACHES
es: ENTRENADORES VINCULADOS

# profile_photo.errors.processing_failed
source: Não foi possível processar a foto selecionada. Escolha outra imagem e tente novamente.
en: Unable to process the selected photo. Choose another image and try again.
es: No se pudo procesar la foto seleccionada. Elige otra imagen e inténtalo de nuevo.

# profile.icons.copied
source: Copiado: %@
en: Copied: %@

# profile.icons.instructions
source: Toque em um ícone para copiar o nome.
en: Tap an icon to copy its name.
es: Toca un icono para copiar su nombre.

# profile.icons.title
source: Meus Ícones
en: My Icons
es: Mis iconos

# profile.unit.change_message
source: Digite a unidade onde você treina. Se deixar em branco, a unidade será removida do perfil.
en: Enter the gym where you train. Leave it blank to remove it from your profile.
es: Ingresa el gimnasio donde entrenas. Déjalo en blanco para eliminarlo de tu perfil.

# profile.unit.change_title
source: Trocar unidade
en: Change gym
es: Cambiar gimnasio

# profile.unit.placeholder
source: Ex.: CROSSFIT MURALHA
en: E.g.: CROSSFIT MURALHA
es: Ej.: CROSSFIT MURALHA

source: Progresso
en: Progress
es: Progreso

source: Progresso da semana
en: Weekly progress
es: Progreso semanal

source: Progresso do aluno
en: Student progress
es: Progreso del alumno

source: Progresso do Aluno
en: Student Progress
es: Progreso del alumno

source: PROGRESSOS
en: PROGRESS
es: PROGRESO

source: Prova
en: Event
es: Prueba

source: PROVA
en: EVENT
es: PRUEBA

source: Próximas semanas
en: Upcoming weeks

source: Próximo
en: Next
es: Siguiente

source: Próximos
en: Upcoming

source: Próximos treinos
en: Upcoming workouts
es: Próximos entrenamientos

source: Publicada
en: Published

source: Publicar
en: Publish

source: Publicar semana
en: Publish week

source: Publicar Treino
en: Publish Workout
es: Publicar entrenamiento

source: Rascunho
en: Draft
es: Borrador

source: RECORDE
en: RECORD
es: RÉCORD

source: Recorde (opcional)
en: Record (optional)
es: Récord (opcional)

source: Recorde Pessoal
en: Personal Record
es: Récord personal

source: Recordes
en: Records
es: Récords

source: Recusado
en: Declined
es: Rechazado

source: Recusar
en: Decline
es: Rechazar

source: Recusar convite
en: Decline invitation
es: Rechazar invitación

source: Recusar convite?
en: Decline invitation?
es: ¿Rechazar invitación?

source: Recusar vínculo
en: Decline link
es: Rechazar vínculo

source: Recusar vínculo?
en: Decline link?
es: ¿Rechazar vínculo?

source: Registre feedbacks e acompanhe o histórico.
en: Record feedback and track the history.
es: Registra comentarios y sigue el historial.

source: Registro não encontrado no Firestore.
en: Record not found in Firestore.
es: Registro no encontrado en Firestore.

source: Remover
en: Remove
es: Eliminar

source: Remover localização
en: Remove location
es: Eliminar ubicación

source: Remover vídeo?
en: Remove video?
es: ¿Eliminar video?

source: Reproduzir com AirPlay
en: Play with AirPlay
es: Reproducir con AirPlay

source: Resultado
en: Result

source: Resultado inicial (opcional)
en: Initial result (optional)

source: Resultado:
en: Result:

source: Resumo da importação
en: Import summary
es: Resumen de importación

source: Resumo de hoje
en: Today's summary
es: Resumen de hoy

source: Sair
en: Sign Out
es: Cerrar sesión

source: Salvar
en: Save
es: Guardar

source: Salvar Alterações
en: Save Changes
es: Guardar cambios

source: Salvar Dia
en: Save Day
es: Guardar día

source: Salvar em Meus Vídeos?
en: Save to My Videos?
es: ¿Guardar en Mis videos?

source: Salvar Treino
en: Save Workout
es: Guardar entrenamiento

source: Salvar WOD
en: Save WOD
es: Guardar WOD

source: Salve links do YouTube para consultar depois.
en: Save YouTube links to view later.
es: Guarda enlaces de YouTube para consultarlos después.

source: Salve novos PRs para acompanhar sua evolução.
en: Save new PRs to track your progress.
es: Guarda nuevos PRs para seguir tu evolución.

source: Se ainda precisar de ajuda, entre em contato pelo e-mail: suporte@rdvperfomance.com
en: If you still need help, contact us by email: suporte@rdvperfomance.com
es: Si aún necesitas ayuda, ponte en contacto por correo electrónico: suporte@rdvperfomance.com

source: SEÇÃO
en: SECTION
es: SECCIÓN

# Seção: %@
source: Seção: %1$@
en: Section: %1$@
es: Sección: %1$@

source: Selecionar
en: Select
es: Seleccionar

source: Selecionar alunos
en: Select students
es: Seleccionar alumnos

source: Selecionar seção
en: Select section
es: Seleccionar sección

source: Selecionar semana
en: Select week
es: Seleccionar semana

source: Selecionar todos
en: Select all
es: Seleccionar todo

source: Selecionar treino
en: Select workout
es: Seleccionar entrenamiento

source: SELECIONAR TREINO
en: SELECT WORKOUT
es: SELECCIONAR ENTRENAMIENTO

# Selecionar treino - %@
source: Selecionar treino - %1$@
en: Select workout - %1$@
es: Seleccionar entrenamiento - %1$@

source: Selecione 3 atalhos.
en: Select 3 shortcuts.
es: Selecciona 3 accesos directos.

source: Selecione a categoria do vínculo
en: Select link category
es: Selecciona la categoría del vínculo

source: Selecione exatamente 3 atalhos.
en: Select exactly 3 shortcuts.
es: Selecciona exactamente 3 accesos directos.

source: Selecione o destino do treino.
en: Select the workout destination.
es: Selecciona el destino del entrenamiento.

# Selecione o destino para: %@
source: Selecione o destino para: %1$@
en: Select destination for: %1$@
es: Selecciona el destino para: %1$@

source: Selecione o movimento
en: Select movement
es: Selecciona el movimiento

source: Selecione um aluno para ver detalhes e criar treinos.
en: Select a student to view details and create workouts.
es: Selecciona un alumno para ver detalles y crear entrenamientos.

source: Selecione um aluno primeiro
en: Select a student first
es: Selecciona primero un alumno

source: Selecione uma seção primeiro
en: Select a section first
es: Selecciona primero una sección

source: Selecione uma seção.
en: Select a section.
es: Selecciona una sección.

source: Selecione uma semana para ver os dias.
en: Select a week to view the days.
es: Selecciona una semana para ver los días.

source: Selecione uma semana válida.
en: Select a valid week.
es: Selecciona una semana válida.

source: Sem blocos cadastrados
en: No blocks registered
es: No hay bloques registrados

source: Sem nome
en: Unnamed
es: Sin nombre

source: Sem permissão para acessar as mensagens desse aluno. Verifique se você está logado como PROFESSOR e se as regras do Firestore liberam /users/{alunoId}/messages.
en: You do not have permission to access this student’s messages. Confirm that you are signed in as a TRAINER and that Firestore rules allow /users/{alunoId}/messages.
es: No tienes permiso para acceder a los mensajes de este alumno. Verifica que hayas iniciado sesión como ENTRENADOR y que las reglas de Firestore permitan /users/{alunoId}/messages.

source: Sem permissão para acessar os feedbacks desse aluno. Verifique se você está logado como PROFESSOR e se as regras do Firestore liberam /users/{alunoId}/feedbacks.
en: No permission to access this student's feedback. Verify that you are signed in as a COACH and that the Firestore rules allow /users/{alunoId}/feedbacks.
es: No tienes permiso para acceder a los comentarios de este alumno. Verifica que hayas iniciado sesión como ENTRENADOR y que las reglas de Firestore permitan /users/{alunoId}/feedbacks.

source: Sem permissão para acessar seus vídeos. Verifique sua autenticação e tente novamente.
en: No permission to access your videos. Verify your authentication and try again.
es: No tienes permiso para acceder a tus videos. Verifica tu autenticación e inténtalo de nuevo.

source: Sem permissão para acessar/importar treinos. Verifique se você está logado e se seu usuário é do tipo PROFESSOR (TRAINER).
en: You do not have permission to access/import workouts. Confirm that you are signed in and that your user type is TRAINER.
es: No tienes permiso para acceder/importar entrenamientos. Verifica que hayas iniciado sesión y que tu tipo de usuario sea ENTRENADOR.

source: Sem permissão para acessar/importar vídeos. Verifique se você está logado e se seu usuário é do tipo PROFESSOR (TRAINER).
en: No permission to access/import videos. Verify that you are signed in and that your user type is COACH (TRAINER).
es: No tienes permiso para acceder o importar videos. Verifica que hayas iniciado sesión y que tu tipo de usuario sea ENTRENADOR (TRAINER).

source: Sem permissão para importar treinos. Verifique se você está logado e se seu usuário é do tipo PROFESSOR (TRAINER).
en: You do not have permission to import workouts. Confirm that you are signed in and that your user type is TRAINER.
es: No tienes permiso para importar entrenamientos. Verifica que hayas iniciado sesión y que tu tipo de usuario sea ENTRENADOR.

source: Sem permissão para remover treinos importados. Verifique se você está logado e se seu usuário é do tipo PROFESSOR (TRAINER).
en: You do not have permission to remove imported workouts. Confirm that you are signed in and that your user type is TRAINER.
es: No tienes permiso para eliminar entrenamientos importados. Verifica que hayas iniciado sesión y que tu tipo de usuario sea ENTRENADOR.

source: Sem permissão para salvar treinos importados. Verifique se você está logado e se seu usuário é do tipo PROFESSOR (TRAINER).
en: You do not have permission to save imported workouts. Confirm that you are signed in and that your user type is TRAINER.
es: No tienes permiso para guardar entrenamientos importados. Verifica que hayas iniciado sesión y que tu tipo de usuario sea ENTRENADOR.

source: Sem permissão para solicitar vínculo. Ajuste as regras do Firestore para permitir localizar professores.
en: You do not have permission to request a connection. Update the Firestore rules to allow trainer lookup.
es: No tienes permiso para solicitar una vinculación. Ajusta las reglas de Firestore para permitir buscar entrenadores.

source: Sem treino
en: No workout
es: Sin entrenamiento

source: Semana
en: Week

source: Semana atual
en: Current week
es: Semana actual

source: Semana completa
en: Full week

source: Semana excluída com sucesso.
en: Week deleted successfully.
es: Semana eliminada correctamente.
